Infineon/micropython-psoc-edge/ports/psoc-edge/machine_pdm_pcm_tdd.c
void ready_to_save() {
    mp_hal_pin_write(&pin_P10_7_obj, 1);
    pdm_pcm_flag = true;
}

void pdm_interrupt_handler(void) {
    volatile uint32_t intr_status = Cy_PDM_PCM_Channel_GetInterruptStatusMasked(PDM0, RIGHT_CH_INDEX);
    if (CY_PDM_PCM_INTR_RX_TRIGGER & intr_status) {
        pdm_pcm_read_rx_buffer();
        Cy_PDM_PCM_Channel_ClearInterrupt(PDM0, RIGHT_CH_INDEX, CY_PDM_PCM_INTR_RX_TRIGGER);
        if (pdm_pcm_is_half_rx_buffer_full()) {
            pdm_pcm_copy_half_rx_buffer_to_ringbuf();
        }
    }
    if ((CY_PDM_PCM_INTR_RX_FIR_OVERFLOW | CY_PDM_PCM_INTR_RX_OVERFLOW | CY_PDM_PCM_INTR_RX_IF_OVERFLOW |
         CY_PDM_PCM_INTR_RX_UNDERFLOW) & intr_status) {
        Cy_PDM_PCM_Channel_ClearInterrupt(PDM0, RIGHT_CH_INDEX, CY_PDM_PCM_INTR_MASK);
    }
}

// ------------------------------------------------------------------------------------------------

#include "py/stream.h"
#include "py/runtime.h"

typedef struct _machine_pdm_pcm_obj_t {
    mp_obj_base_t base;
} machine_pdm_pcm_obj_t;

machine_pdm_pcm_obj_t *pdm_pcm_obj;

static uint32_t fill_appbuf_from_ringbuf(machine_pdm_pcm_obj_t *self, mp_buffer_info_t *appbuf) {
    uint32_t num_bytes_copied_to_appbuf = 0;
    uint8_t *app_p = (uint8_t *)appbuf->buf;
    uint32_t num_bytes_needed_from_ringbuf = appbuf->len;
    uint8_t data;

    while (num_bytes_needed_from_ringbuf-- > 0) {
        while (ringbuf_pop(&ring_buffer, &data) == false) {
            ;
        }
        app_p[num_bytes_copied_to_appbuf++] = data;
        // num_bytes_needed_from_ringbuf--;
    }
    return num_bytes_copied_to_appbuf;
}

static void machine_pdm_pcm_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    /* TODO: Add implementation*/
}

// PDM_PCM(...) Constructor
static mp_obj_t machine_pdm_pcm_make_new(const mp_obj_type_t *type, size_t n_pos_args, size_t n_kw_args, const mp_obj_t *args) {
    /* TODO: Add implementation*/
    machine_pdm_pcm_obj_t *self = NULL;

    self = mp_obj_malloc(machine_pdm_pcm_obj_t, &machine_pdm_pcm_type);
    pdm_pcm_obj = self;

    return MP_OBJ_FROM_PTR(self);
}

static mp_obj_t machine_pdm_pcm_init(mp_obj_t self_in) {
    /* TODO: Add implementation*/

    app_pdm_pcm_init();
    app_pdm_pcm_activate();
    // save_audio_to_file();

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_pdm_pcm_init_obj, machine_pdm_pcm_init);

static mp_obj_t machine_pdm_pcm_is_ready(mp_obj_t self_in) {
    /* TODO: Add implementation*/

    if (audio_file_saved) {
        return mp_const_true;
    } else {
        return mp_const_false;
    }

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_pdm_pcm_is_ready_obj, machine_pdm_pcm_is_ready);

static mp_uint_t machine_pdm_pcm_stream_read(mp_obj_t self_in, void *buf_in, mp_uint_t size, int *errcode) {
    /* TODO: Add implementation*/
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(self_in);

    uint8_t appbuf_sample_size_in_bytes = (bits / 8) * (format == STEREO ? 2: 1);

    if (size % appbuf_sample_size_in_bytes != 0) { // size should be multiple of sample size
        *errcode = MP_EINVAL;
        return MP_STREAM_ERROR;
    }

    if (size == 0) {
        return 0;
    }

    if (io_mode == BLOCKING) {
        mp_buffer_info_t appbuf;
        appbuf.buf = (void *)buf_in;
        appbuf.len = size;
        // #if MICROPY_PY_MACHINE_PDM_PCM_RING_BUF
        uint32_t num_bytes_read = fill_appbuf_from_ringbuf(self, &appbuf);
        // #else
        // uint32_t num_bytes_read = fill_appbuf_from_dma(self, &appbuf);
        // #endif
        return num_bytes_read;
    }
    /* TODO: NON-BLOCKING implementation */

    return 0;
}

static const mp_stream_p_t pdm_pcm_stream_p = {
    .read = machine_pdm_pcm_stream_read,
    .is_text = false,
};

static const mp_rom_map_elem_t machine_pdm_pcm_locals_dict_table[] = {
    // Methods
    { MP_ROM_QSTR(MP_QSTR_init),            MP_ROM_PTR(&machine_pdm_pcm_init_obj) },

    { MP_ROM_QSTR(MP_QSTR_isready),         MP_ROM_PTR(&machine_pdm_pcm_is_ready_obj) },

    { MP_ROM_QSTR(MP_QSTR_readinto),        MP_ROM_PTR(&mp_stream_readinto_obj) },
};
MP_DEFINE_CONST_DICT(machine_pdm_pcm_locals_dict, machine_pdm_pcm_locals_dict_table);

MP_DEFINE_CONST_OBJ_TYPE(
    machine_pdm_pcm_type,
    MP_QSTR_PDM_PCM,
    MP_TYPE_FLAG_ITER_IS_STREAM,
    make_new, machine_pdm_pcm_make_new,
    print, machine_pdm_pcm_print,
    protocol, &pdm_pcm_stream_p,
    locals_dict, &machine_pdm_pcm_locals_dict
    );

#endif // MICROPY_PY_MACHINE_PDM_PCM_TDD
